Revit 2027 API
AddInId.GetAddInNameFromDocument Method
 name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAddInNameFromDocument(
	Document aDoc
)
Public Function GetAddInNameFromDocument (
	aDoc As Document
) As String
public:
String^ GetAddInNameFromDocument(
	Document^ aDoc
)
member GetAddInNameFromDocument :
        aDoc : Document -> string
Parameters
aDoc Document
 target document
Return Value
String
 name of application
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
AddInId Class
Autodesk.Revit.DB Namespace